{
  "backend/main.mo": "Motoko actor implementing the backend canister with persistent stores for contact form submissions and newsletter emails, plus admin-only query functions protected by an access control mixin.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence changes to Courses.tsx — updated Google Form enrollment links for the Panchang & Remedies, Advanced Predictive Astrology, and Predictive Prashna courses.",
  "frontend-file-summaries.txt": "JSON map of short summaries for every frontend source file, describing the purpose and key contents of each component, hook, page, and config file.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including background, foreground, accent, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point with full SEO meta tags, Open Graph properties, and Google Fonts preloads for Playfair Display and Inter, mounting the React app at #root.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with two routes: '/' rendering the full homepage layout and '/admin' rendering the AdminPortal page.",
  "frontend/src/components/About.tsx": "About section component displaying Astrologer Nishant Madhav's avatar, biography, and four expertise area cards (Birth Chart, Nakshatra, Dasha, Career & Marriage).",
  "frontend/src/components/Contact.tsx": "Contact section component with phone/email info cards, a newsletter signup form, and a contact form that submits data to the backend canister via React Query mutations.",
  "frontend/src/components/Courses.tsx": "Defines and renders a 'Premium Courses' section with four Vedic astrology course cards, each showing pricing, features, badge, and a Google Form enrollment link.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, quick navigation links, a consultation booking CTA, and a copyright notice.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with logo, desktop/mobile nav links, an admin link shown only when authenticated via Internet Identity, and a 'Book Consultation' button.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, headline, gold divider, and two CTAs for booking a consultation and scrolling to the courses section.",
  "frontend/src/components/Services.tsx": "Renders a grid of four Vedic astrology consultation service cards, each with an icon, title, description, highlights, and a booking link.",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp button in the bottom-right corner that links to a WhatsApp chat number and shows a tooltip on hover.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting contact forms, subscribing to newsletters, and fetching admin data (contact submissions and newsletter subscribers) via the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a custom design system with CSS variables for a warm ivory/gold/saffron color palette, including dark mode and utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPortal.tsx": "Admin portal page that shows a login screen for unauthenticated users and displays tabbed views of contact form submissions and newsletter subscribers for authenticated admins.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom fonts (Playfair Display, Inter), oklch-based color tokens (gold, saffron, ivory, sidebar, chart, etc.), border radius, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current state (version 13) of the SHRIMADHAV ASTROLOGY project, documenting its summary, architectural notes, known issues, and a list of existing implemented features covering theme, hero, about, consultation, courses, and contact sections."
}